app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["body", "asdfsadfasdfasdfasdfasdf"], ["created_at", "2022-05-10 06:26:45.838523"], ["updated_at", "2022-05-10 06:26:45.838523"]]
---
  def create
    @article = Article.new(article_params)
    # binding.pry
    if @article.save