app/controllers/comments_controller.rb

INSERT INTO "comments" ("title", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Kavepol"], ["body", "I love Apple give me Iphone14"], ["article_id", 7], ["created_at", "2022-05-11 09:58:05.916533"], ["updated_at", "2022-05-11 09:58:05.916533"]]
---
  def create
    @comment = @article.comments.new(comment_params)
    if @comment.save

UPDATE "comments" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["title", "Test"], ["body", "TestTestTestTestTest"], ["updated_at", "2022-05-12 03:10:32.239235"], ["id", 5]]
---
  def update
    if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def destroy
    if @comment.delete